<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;

use App\Models\Category;
use App\Models\Chat;
use App\Models\ChatMessage;
use App\Models\Gig;
use App\Models\Option;
use App\Models\Post;
use App\Models\Rate;
use App\Models\Review;
use App\Models\User;
use App\Notifications\GigApproved;
use App\Notifications\Test;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Auth;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;
use Spatie\Permission\Models\Role;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        $admin = Role::create([
            "name" => "Admin",
        ]);
        $member = Role::create([
            "name" => "Member",
        ]);

        $this->defaultOptions();
        $this->createCategrories();
        \App\Models\User::factory(200)->create();
        \App\Models\Gig::factory(200)->create();
        // \App\Models\Extra::factory(500)->create();
        \App\Models\Order::factory(1000)->create();
        \App\Models\Earning::factory(200)->create();
        \App\Models\Invoice::factory(200)->create();
        \App\Models\Request::factory(100)->create();
        \App\Models\Comment::factory(200)->create();
        // $this->chats();
        // \App\Models\ChatMessage::factory(500)->create();
        $this->createSomePosts();
        $this->createReviews();
        $this->notifications();

        $user = User::create([
            'name' => "Admin Admin",
            'email' => "admin@email.com",
            'password' => Hash::make('admin'),

            'username' => 'admin',
            'specialization' => 'admin',
            'thumbnail' => 'default-thumbnail.png',
            'description' => 'Admin',

            'token' => 'admin'
        ]);

        $user->assignRole('Admin');

        Auth::login($user);
    }

    public function defaultOptions()
    {
        Option::create([
            'name' => 'faqs',
            'content' => json_encode([
                [
                    'id' => 1,
                    'title' => 'ما هو خمسات؟',
                    'body' => 'خمسات هو أكبر سوق عربي لبيع وشراء الخدمات المصغرة. يجمع خمسات بين الشباب العربي الموهوب المستعد لتقديم خبراته ومهاراته على شكل خدمات مصغرة بأسعار تبدأ من 5 دولار، وبين الأفراد ورواد الأعمال الذين يحتاجون هذه الخدمات لتساعدهم في تنمية وتطوير أعمالهم.'
                ],
                [
                    'id' => 2,
                    'title' => 'كيف يمكن أن أستفيد من خمسات؟',
                    'body' => 'قد يتوقف إطلاق شركتك على تصميم شعار، أو يتوقف عملك بسبب الحاجة لمحتوى متجدد لموقعك، ربما تملك فكرة رائعة لبرنامج أو تطبيق ولكن ليست لديك أدنى فكرة عن البرمجة والتطوير، لديك بحث دراسي أو ترجمة مطلوبة في وقت معين وتحتاج لمن يساعدك فيها.

                    يوفّر خمسات كل الخدمات الإبداعية والاحترافية التي تحتاجها لتنمية وتطوير أعمالك، والتي يمكن طلبها من أشخاص موهوبين مستعدين لخدمتك في إنجاز مهامك بسهولة عبر الإنترنت وبأسعار اقتصادية تتناسب مع الأفراد ورواد الأعمال من أصحاب المشاريع الناشئة.'
                ],
                [
                    'id' => 3,
                    'title' => 'كيف يضمن موقع خمسات حقوقي؟',
                    'body' => 'موقع خمسات يضمن لك حقوقك بشكل كامل، كن مطمئنا عند شراء أي خدمة معروضة في الموقع، يقوم خمسات بدور الوسيط بين المشتري والبائع ويحمي حقوق الطرفين المالية في حال الالتزام بشروط موقع خمسات وبنود الضمان والإبقاء على جميع التواصلات داخل الموقع.'
                ],
                [
                    'id' => 4,
                    'title' => 'ماذا سيحدث بعد شرائي لأحد الخدمات المعروضة في خمسات؟',
                    'body' => 'ستصلك رسالة بريدية لتأكيد عملية الشراء، وستتمكن من التواصل المباشر مع البائع ضمن صفحة الطلب. بعد قيام البائع بتنفيذ وتسليم الخدمة يمكنك تقييمها حتى يستفيد بقية المشترين من تجربتك، وفي حال تأخر البائع عن مدة تنفيذ الطلب الموضحة أو عدم التزامه بالوصف المحدد للخدمة يمكنك إلغاء الطلب واستعادة رصيدك كاملًا.'
                ],
                [
                    'id' => 5,
                    'title' => 'ماذا لو لم أكن راضيا عن مستوى الخدمة المستلمة؟',
                    'body' => 'في حال عدم رضاك عن الخدمة المستلمة يمكنك طلب التعديلات عليها من البائع، وفي حال كانت الخدمة المستلمة دون الجودة الموضحة في وصف الخدمة، يمكنك إلغاء الطلب ببساطة ليعود الرصيد لحسابك وتتمكن من شراء إحدى الخدمات الأخرى على الموقع. عند مواجهتك لأي مشكلة لا تتردد في التواصل بشكل مباشر مع خدمة العملاء عن طريق مركز المساعدة.'
                ],
            ], JSON_UNESCAPED_UNICODE)
        ]);

        Option::create([
            'name' => 'about_menu',
            'content' => json_encode([
                [
                    'id' => 1,
                    'title' => ' كيف يعمل الموقع',
                    'link' => '#'
                ],
                [
                    'id' => 1,
                    'title' => 'حول خمسات',
                    'link' => '#'
                ],
                [
                    'id' => 1,
                    'title' => ' الأسئلة الشائعة',
                    'link' => '#'
                ],
                [
                    'id' => 1,
                    'title' => ' ضمان الحقوق',
                    'link' => '#'
                ],
                [
                    'id' => 1,
                    'title' => ' مركز المساعدة',
                    'link' => '#'
                ],
            ], JSON_UNESCAPED_UNICODE)
        ]);

        Option::create([
            'name' => 'facebook_url',
            'content' => 'https://facebook.com/ajamaaabdo'
        ]);
        Option::create([
            'name' => 'twitter_url',
            'content' => 'https://twitter.com/ajamaaabdo'
        ]);
        Option::create([
            'name' => 'currency_code',
            'content' => '$'
        ]);
        Option::create([
            'name' => 'payment_fees',
            'content' => 2
        ]);
        Option::create([
            'name' => 'stripe_secret_key',
            'content' => ""
        ]);
        Option::create([
            'name' => 'stripe_public_key',
            'content' => ""
        ]);
        Option::create([
            'name' => 'paypal_client_id',
            'content' => ""
        ]);

        Option::create([
            'name' => 'footer_menu',
            'content' => json_encode([
                [
                    'id' => 1,
                    'title' => 'شروط الاستخدام',
                    'link' => '#'
                ],
                [
                    'id' => 1,
                    'title' => 'بيان الخصوصية',
                    'link' => '#'
                ],
                [
                    'id' => 1,
                    'title' => 'المستويات',
                    'link' => '#'
                ],
                [
                    'id' => 1,
                    'title' => 'التسويق بالعمولة',
                    'link' => '#'
                ],
            ], JSON_UNESCAPED_UNICODE)
        ]);

        Option::create([
            'name' => 'reviews_types',
            'content' => [
                Str::slug('جودة الخدمة') => 'جودة الخدمة',
                Str::slug('التواصل والمتابعة') => 'التواصل والمتابعة',
                Str::slug('التسليم بالموعد') => 'التسليم بالموعد',
            ],
        ]);

        Option::create([
            'name' => 'withdrawal_methods',
            'content' => [
                'paypal' => 'paypal',
                'bank' => 'bank',
            ],
        ]);
    }

    protected function createCategrories()
    {
        $cats = [
            "تصميم منازل",
            "تصميم شقق",
            "تصميم استراحات",
            "تصميم لوقو",
            "تصميم الديكور",
            "التصميم البيئي",
        ];

        foreach ($cats as $cat) {
            Category::create([
                'name' => $cat,
                'slug' => Str::slug($cat),
            ]);
        }
    }

    protected function createSomePosts()
    {
        for ($i = 1; $i < 50; $i++) {
            Post::create([
                'title' => "دليلك الشامل إلى الإدارة المالية financial management " . $i,
                'slug' => fake('ar')->slug(4),
                'content' => '<section class="post-content">
                <p>تلعب الإدارة المالية Financial management دورًا مهمًا في ضمان الاستقرار المالي ونجاح المؤسسات، وذلك عن طريق مساعدتها على اتخاذ قرارات مالية صحيحة، فضلًا عن إدارة مواردها بفعالية لتحقيق أهدافها، فما هي الإدارة المالية؟ وما أهميتها؟</p>
                <p><strong>جدول المحتويات:</strong></p>
                <ul>
                <li aria-level="1"><a href="#financial-management">ما هي الإدارة المالية؟</a></li>
                <li aria-level="1"><a href="#financial-management-types">أنواع الإدارة المالية</a></li>
                <li aria-level="1"><a href="#financial-management-importance">أهمية الإدارة المالية</a></li>
                <li aria-level="1"><a href="#financial-management-goals">أهداف الإدارة المالية</a></li>
                <li aria-level="1"><a href="#financial-management-principles">مبادئ الإدارة المالية</a></li>
                <li aria-level="1"><a href="#financial-management-departments">أقسام الإدارة المالية</a></li>
                <li aria-level="1"><a href="#financial-management-example">مثال على تأثير الإدارة المالية في الأنشطة التجارية</a></li>
                <li aria-level="1"><a href="#duties-of-financial-manager">مهام المدير المالي</a></li>
                </ul>
                <h2 id="financial-management">ما هي الإدارة المالية؟</h2>
                <p>الإدارة المالية financial management هي عملية تخطيط وتنظيم ومراقبة الموارد المالية لمنظمة ما تحقيقًا لأهدافها، إذ تتضمن استخدام أدوات وتقنيات مالية مختلفة لإدارة الأنشطة المالية، مثل إعداد الميزانية وإدارة النقد والمحاسبة وتحليل الاستثمار، فضلًا عن التحليل المالي.</p>
                <h3>ما الفرق بين الإدارة المالية والمحاسبة؟</h3>
                <p>رغم أن هناك ارتباطًا كبيرًا بين الإدارة المالية والمحاسبة، إلا أنهما مجالان متمايزان لهما أهدافًا ووظائف مختلفة. فتركز الإدارة المالية على إدارة الموارد المالية للمؤسسة لتحقيق أهدافها، من خلال تخطيط الأنشطة المالية وتنظيمها ومراقبتها. وتهتم بالصحة المالية العامة للمؤسسة، ودعم اتخاذ القرارات التي تعمل على تحسين استخدام الموارد المالية.</p>
                <p>أما المحاسبة، فهي عملية تسجيل وتصنيف وتلخيص المعاملات المالية المختلفة للمؤسسة. إذ توفر المحاسبة المعلومات المالية التي تستخدم في الإدارة المالية لاتخاذ القرارات، فالهدف الأساسي للمحاسبة هو توفير معلومات مالية دقيقة في الوقت المناسب لأصحاب المصلحة، من الإدارة والمستثمرين والدائنين والمنظمين.</p>
                <p>ببساطة، تهتم الإدارة المالية بالإدارة الفعالة للموارد المالية لتحقيق الأهداف التنظيمية، وتعتمد على المعلومات المحاسبية، كما تتضمن أدوات وتقنيات مالية أخرى لاتخاذ قرارات مالية فعالة. بينما تهتم المحاسبة بتوفير معلومات مالية دقيقة في الوقت المناسب.</p>
                <h2 id="financial-management-types">أنواع الإدارة المالية</h2>
                <p>يمكن تصنيف الإدارة المالية للشركات إلى ثلاثة أنواع:</p>
                <ol>
                <li aria-level="1"><strong>الإدارة المالية قصيرة الأجل:</strong> إدارة الموارد المالية قصيرة الأجل للمؤسسة، مثل النقد والحسابات مستحقة القبض والمخزون، وتهدف الإدارة المالية قصيرة الأجل للتأكد من أن المنظمة لديها تدفق نقدي كافٍ للوفاء بالتزاماتها قصيرة الأجل.</li>
                <li aria-level="1"><strong>الإدارة المالية متوسطة الأجل:</strong> تتعامل مع الموارد المالية للمنظمة لفترة متوسطة الأجل، تتراوح عادةً بين سنة وخمس سنوات، وتشمل أنشطة مثل: الميزانية الرأسمالية وتمويل المشاريع وإدارة رأس المال العامل، وتهدف إلى التأكد من أن المنظمة لديها موارد مالية كافية للقيام بمشاريع واستثمارات جديدة.</li>
                <li aria-level="1"><strong>الإدارة المالية طويلة الأجل:</strong> عادةً ما يكون تخطيط هذه الإدارة لمدة أطول من خمس سنوات، ويشمل أنشطة مثل: التخطيط المالي الاستراتيجي، وعمليات الدمج والاستحواذ، وإعادة هيكلة الشركات، وتهدف إلى ضمان الاستدامة المالية طويلة الأجل ونمو المنظمة.</li>
                </ol>
                <h2 id="financial-management-importance">ما أهمية الإدارة المالية؟</h2>
                <p>للإدارة المالية أهمية حاسمة لأي مؤسسة، لأنها تساعد في تحقيق الأهداف المالية، واتخاذ قرارات مالية مستنيرة، فضلًا عن ضمان الاستقرار المالي والنمو، وفيما يلي بعض الأسباب الرئيسية لأهمية الإدارة المالية:</p>
                <h3>التخطيط المالي وتحسين الموارد</h3>
                <p>تساعد الإدارة المالية في وضع خارطة طريق لتحقيق الأهداف المالية، من خلال تحديد الأولويات، ووضع الأهداف ووضع خطة لتحقيقها. كما توفر إطارًا لاتخاذ قرارات مالية مستنيرة، مع تقديم اقتراحات لتخصيص الموارد بفعالية.</p>
                <p>كما تعمل على تحسين استخدام الموارد المالية استخدامًا مثاليًا، من خلال ضمان استخدامها بكفاءة وفعالية، ويتضمن ذلك تحديد مجالات عدم الكفاءة والهدر، وتقديم اقتراحات بإجراءات تصحيحية لتحسين الأداء المالي.</p>
                <h3>التحليل المالي ودعم قرارات الاستثمار</h3>
                <p>تتضمن الإدارة المالية تحليل البيانات المالية لاكتساب نظرة ثاقبة على الصحة المالية للمنظمة، وتوفير معلومات حول التدفق النقدي والربحية والسيولة والأداء المالي الذي يُعدّ أمرًا ضروريًا لاتخاذ قرارات مالية مستنيرة.</p>
                <p>أيضًا تيسر الإدارة المالية اتخاذ قرارات الاستثمار من خلال تقييم خيارات الاستثمار المختلفة، واختيار تلك التي تقدم أفضل العوائد. ذلك عن طريق تحليل اتجاهات السوق، وتقييم المخاطر، وتطوير استراتيجيات الاستثمار التي تتوافق مع الأهداف المالية.</p>
                <h3>إدارة المخاطر ودعم الامتثال التنظيمي</h3>
                <p>تساعد الإدارة المالية في إدارة المخاطر المالية مثل؛ مخاطر السوق والائتمان، ومخاطر السيولة والتشغيل. وتقدم اقتراحات لتطوير استراتيجيات للتخفيف من هذه المخاطر وحماية الأصول المالية. كما تساعد في ضمان الامتثال للمتطلبات التنظيمية مثل قوانين الضرائب، ومعايير المحاسبة، ومتطلبات إعداد التقارير المالية. وهو ما يساعد في تجنب الوقوع فريسة للعقوبات القانونية التي قد تحدث بسبب عدم الامتثال.</p>
                <h3>دعم النمو والتوسع والمصداقية</h3>
                <p>تلعب الإدارة المالية دورًا حاسمًا في نمو المنظمة، بتحديد فرص النمو وتقييم المخاطر المحتملة وتطوير الاستراتيجيات المالية التي تدعم النمو والتوسع. كما يمكن للإدارة المالية الفعالة أن تساعد المنظمة على توسيع عملياتها، ودخول أسواق جديدة وتحقيق أهداف نموها.</p>
                <p>بالإضافة إلى ذلك، تدعم الإدارة المالية بناء المصداقية مع أصحاب المصلحة، بما في ذلك المستثمرين والدائنين والعملاء، عن طريق الاحتفاظ بسجلات مالية دقيقة، وتوفير المعلومات المالية في الوقت المناسب، والامتثال للمتطلبات التنظيمية.</p>
                <h2 id="financial-management-goals">ما هي أهداف الإدارة المالية؟</h2>
                <p>هناك عدّة أهداف أساسية للإدارة المالية سواء للأفراد أو المؤسسات، وهي بمثابة مجموعة واسعة من الأنشطة والاستراتيجيات التي تهدف إلى تحقيق هذه الأهداف، وفيما يلي بعض الأهداف الرئيسية للإدارة المالية:</p>
                <h3>تعظيم الربح والثروة</h3>
                <p>يُعدّ تعظيم الأرباح أمرًا مهمًا لزيادة ثروة المساهمين، وضمان الاستدامة المالية طويلة الأجل للمنظمة. إذ تقوم الإدارة المالية بذلك من خلال تحديد فرص توليد الدخل وخفض التكاليف، كما تعمل على تعظيم الثروة من خلال زيادة قيمة المنظمة، وذلك باتخاذ قرارات مالية قوية تعزز قيمة المنظمة وتزيد من ثروة المساهمين.</p>
                <h3>إدارة التدفق النقدي</h3>
                <p>تضمن الإدارة المالية أن المنظمة لديها نقود كافية للوفاء بالتزاماتها المالية، وإدارة رأس المال العامل، مثل الحسابات مستحقة القبض والمخزون، والتأكد من أن التدفقات النقدية الداخلة تتجاوز التدفقات النقدية الخارجة، مما يجنب المنظمة الوقوع في الأزمات المالية. كما أنها تدفع إلى الاستثمار في المشاريع التي تقدم أعلى <a href="https://blog.mostaql.com/return-on-investment/">عائد على الاستثمار</a>، عن طريق تقييم فرص الاستثمار المحتملة، وتقييم المخاطر المرتبطة بكل استثمار.</p>
                <h3>مراقبة التكاليف وتجهيز التقارير المالية</h3>
                <p>أحد أهم أهداف الإدارة المالية هو مراقبة التكاليف لتقليل النفقات وزيادة الكفاءة، عن طريق تحديد مجالات عدم الكفاءة والهدر، واتخاذ إجراءات تصحيحية لخفض التكاليف. كما تضطلع الإدارة المالية بمهمة توفير معلومات مالية دقيقة في الوقت المناسب لأصحاب المصلحة، مثل المستثمرين والدائنين والهيئات التنظيمية.</p>
                <h3>التخطيط الضريبي</h3>
                <p>تهدف الإدارة المالية إلى تقليل الالتزامات الضريبية للمؤسسة، من خلال تطوير استراتيجيات التخطيط الضريبي الفعالة، وذلك بفهم اللوائح والقوانين الضريبية، وتحديد فرص توفير الضرائب، وضمان الامتثال للقوانين الضريبية.</p>
                <p>كما تهدف أيضًا إلى تحديد هيكل رأس المال الأمثل للمنظمة، عن طريق تحليل احتياجات التمويل للمؤسسة وتقييم خيارات التمويل المختلفة، واختيار مزيج التمويل الذي يقلل من تكلفة رأس المال ويزيد من قيمة المساهمين.</p>
                <h3>تطوير سياسة توزيع الأرباح</h3>
                <p>توازن الإدارة المالية بين حاجة المنظمة للنمو وحاجة المساهمين إلى الدخل، وتقيم الأداء المالي للمؤسسة، وكذلك التدفقات النقدية المستقبلية، من أجل تحديد المستوى المناسب لأرباح الأسهم التي يجب دفعها للمساهمين. كما تضمن الإدارة المالية حوكمة فعالة للشركات، من خلال إنشاء أنظمة وعمليات مناسبة تعزز الشفافية.</p>
                <h2 id="financial-management-principles">مبادئ الإدارة المالية</h2>
                <p>هناك العديد من مبادئ الإدارة المالية التي يجب على المنظمات اتباعها لضمان الإدارة المالية الفعالة، وتتمثل هذه المبادئ فيما يلي:</p>
                <ol>
                <li><strong>مبدأ تحديد الأهداف:</strong> تستند الإدارة المالية إلى أهداف مالية محددة قابلة للتحقيق تتماشى مع أهداف المنظمة.</li>
                <li><strong>الربحية:</strong> ت<span style="font-size: revert; color: initial;">ركز الإدارة المالية على تحقيق أرباح للمنظمة من خلال زيادة الإيرادات والتحكم في التكاليف.</span></li>
                <li><strong>السيولة:</strong><span style="font-size: revert; color: initial;"> يضمن أن لدى المنظمة ما يكفي من السيولة النقدية والأصول السائلة للوفاء بالتزاماتها المالية قصيرة الأجل.</span></li>
                <li><strong>الملاءة المالية:</strong><span style="font-size: revert; color: initial;"> يضمن أن المنظمة لديها أصول كافية للوفاء بالتزاماتها المالية طويلة الأجل، وتظل قادرة على الوفاء بها.</span></li>
                <li><strong>الكفاءة:</strong> <span style="font-size: revert; color: initial;">تضمن الإدارة المالية استخدام الموارد المالية بكفاءة لتوليد أقصى قيمة للمنظمة.</span></li>
                <li><strong>حقوق الملكية:</strong> <span style="font-size: revert; color: initial;">تضمن الإدارة المالية توزيع الموارد المالية بشكلٍ منصف بين أصحاب المصلحة، بما في ذلك المساهمين والموظفين والدائنين.</span></li>
                <li><strong>الشفافية:</strong><span style="font-size: revert; color: initial;"> ترتكز الإدارة المالية على الشفافية والخضوع للمساءلة، وتضمن الكشف عن المعلومات المالية لأصحاب المصلحة في الوقت المناسب وبطريقة دقيقة.</span></li>
                <li><strong>إدارة المخاطر:</strong> <span style="font-size: revert; color: initial;">تتعامل الإدارة المالية مع المخاطر المالية، بما في ذلك مخاطر السوق والائتمان، ومخاطر السيولة والتشغيل، لتقليل تأثيرها على المؤسسة.</span></li>
                <li><strong>القيمة الزمنية للنقود:</strong> <span style="font-size: revert; color: initial;">تدرك الإدارة المالية القيمة الزمنية للنقود، ما يعني أن الأموال المستلمة في المستقبل تساوي أقل من الأموال المستلمة اليوم، وتستخدم هذا المبدأ في قرارات الاستثمار والتمويل.</span></li>
                <li><strong>تحليل التكلفة والعائد:</strong> <span style="font-size: revert; color: initial;">تستخدم الإدارة المالية تحليل التكلفة والعائد لتقييم قرارات الاستثمار والتمويل، وتحديد الخيارات التي تقدم أعلى عائد على الاستثمار.</span></li>
                </ol>
                <h2 id="financial-management-departments">أقسام الإدارة المالية</h2>
                <p>تشمل الإدارة المالية financial management على عدد من الإدارات المختلفة التي تعمل معًا لإدارة الموارد المالية للمؤسسة بفعالية، وتنقسم هذه الإدارات إلى:</p>
                <ul>
                <li aria-level="1"><strong>قسم المحاسبة:</strong> يسجل ويتتبع جميع المعاملات المالية للمنظمة، إذ يُعدّ البيانات المالية، بما في ذلك الميزانيات العمومية وبيانات الدخل والتدفق النقدي، ويضمن امتثال السجلات المالية للمعايير واللوائح المحاسبية.</li>
                <li aria-level="1"><strong>الخزينة:</strong> يدير الخزانة النقدية والاستثمارات في المنظمة، بما في ذلك مراقبة التدفق النقدي، والتنبؤ بالاحتياجات النقدية، واستثمار الأموال الفائضة. كما يدير العلاقات المصرفية للمؤسسة، بما في ذلك التفاوض بشأن خطوط الائتمان وإدارة الحسابات المصرفية.</li>
                <li aria-level="1"><strong>التخطيط والتحليل:</strong> يطور وينفذ الخطط المالية ويحلل البيانات المالية لدعم اتخاذ القرار، فضلًا عن إعداد الميزانيات وتوقع الأداء المالي، وإجراء <a href="https://blog.khamsat.com/financial-analysis/">التحليل المالي</a> لتقييم فرص الاستثمار وتقييم الصحة المالية للمؤسسة.</li>
                <li aria-level="1"><strong>قسم إدارة المخاطر:</strong> يحدد ويدير المخاطر المالية، بما في ذلك مخاطر السوق والائتمان والسيولة والتشغيل، كما يلتزم بتطوير سياسات وإجراءات إدارة المخاطر، بالإضافة إلى تنفيذ استراتيجياتها لحماية المنظمة من الخسائر المحتملة.</li>
                <li aria-level="1"><strong>الضرائب:</strong> يدير الشؤون الضريبية للمؤسسة، بما في ذلك إعداد الإقرارات الضريبية، وضمان الامتثال للوائح والقوانين الضريبية، وتطوير استراتيجيات التخطيط الضريبي لتقليل الالتزامات الضريبية للمؤسسة.</li>
                <li aria-level="1"><strong>التدقيق والمراجعة:</strong> يجري عمليات التدقيق الداخلي، للتأكد من أن السجلات والعمليات المالية للمؤسسة دقيقة ومتوافقة مع السياسات الداخلية واللوائح الخارجية، كما يجري عمليات تدقيق خارجية لضمان الامتثال للمعايير واللوائح المحاسبية.</li>
                <li aria-level="1"><strong>قسم علاقات المستثمرين:</strong> يدير علاقات المؤسسة مع المستثمرين والمساهمين، كما يوفر المعلومات لمجتمع الاستثمار.</li>
                <li aria-level="1"><strong>قسم الأنظمة المالية:</strong> يدير برامج المحاسبة وأدوات إعداد التقارير المالية، وكذلك أنظمة الإدارة المالية الأخرى، كما يضمن أن هذه الأنظمة محدثة وآمنة ومتكاملة مع أنظمة الأعمال الأخرى.</li>
                </ul>
                <h2 id="financial-management-example">مثال على تأثير الإدارة المالية في الأنشطة التجارية</h2>
                <p>قد يقرر الفريق المالي للشركة أن الاستثمار في صناعة مستلزمات الملابس يمكن أن يمثل فرصة كبيرة لتحقيق احتياطيات نقدية إضافية للشركة، نظرًا لانتشار هذا النشاط في المنطقة التي تستثمر فيها الشركة. هنا يجري الفريق تحليلًا ماليًا لهذا الاستثمار المحتمل، ويحدد جوانب مثل العوائد المحتملة منه والتكاليف والمخاطر المرتبطة به. ثم يقدم المعلومات إلى المديرين التنفيذيين للشركة لمراجعتها.</p>
                <p>عند المراجعة، قد يقرر الفريق التنفيذي أن الاستثمار يمكن أن يكون فرصة جيدة ويمنح الإذن للفريق المالي لتنظيم عملية الاستثمار. ليأتي دور الإدارة المالية مرة أخرى لتحدد مقدار الأموال التي يمكن للشركة تحملها بشكلٍ معقول للمخاطرة بالاستثمار، ثم تعمل على تسهيل عملية الاستثمار، وإنشاء خطة تتبُّع لمراقبة تقدم ونجاح الاستثمار بمرور الوقت، مع إتاحة نتائج وتطورات هذه الخطة للمديرين التنفيذيين للشركة.</p>
                <p>هذا يوضح مدى تأثير الإدارة المالية على الأنشطة التجارية، لهذا السبب يجب أن يكون لدى المدير المالي فهم عميق لمبادئ وتقنيات الإدارة المالية، بالإضافة إلى القدرة على العمل بشكلٍ تعاوني مع أصحاب المصلحة في المنظمة. فإذا كنت تحتاج إلى إنجاز بعض مهام الإدارة المالية بشركتك، فيفضل الاستعانة بخبراء الإدارة المالية، الذين يقدِّمون <a href="https://khamsat.com/search?q=">خدمات الإدارة المالية</a> على موقع خمسات، أكبر سوق عربي لبيع وشراء الخدمات المصغرة.</p>
                <h2 id="duties-of-financial-manager">ما هي مهام المدير المالي؟</h2>
                <p>من الممكن أن تختلف مهام المدير المالي اعتمادًا على المنظمة والصناعة، لكنها عادةً تشمل مجموعة من المهام الشائعة، وهي:</p>
                <ul>
                <li aria-level="1"><strong>التخطيط والتحليل المالي:</strong> يختص المدير المالي بتطوير وتنفيذ الخطط والاستراتيجيات المالية التي تتوافق مع أهداف المنظمة، ويشمل ذلك التنبؤ بالإيرادات والمصروفات والتدفق النقدي، فضلًا عن تحليل الأداء المالي وتحديد المخاطر والفرص، وتخصيص الموارد لتحقيق الأهداف المالية.</li>
                <li aria-level="1"><strong>إدارة التدفق النقدي:</strong> يتأكد المدير المالي من أن المؤسسة لديها سيولة كافية للوفاء بالتزاماتها قصيرة الأجل، عن طريق مراقبة التدفقات النقدية الداخلة والخارجة، والتنبؤ بالاحتياجات النقدية، واستثمار الأموال الفائضة.</li>
                <li aria-level="1"><strong>إدارة الاستثمار:</strong> يعمل على إدارة استثمارات المنظمة لتوليد العوائد وتعظيم القيمة، فضلًا عن مهام تطوير استراتيجيات الاستثمار، وتحليل فرصه، ومراقبة أدائه.</li>
                <li aria-level="1"><strong>إعداد التقارير المالية:</strong> يُعدّ المدير المالي البيانات المالية ويحللها، للتأكد من أنها دقيقة وكاملة ومتوافقة مع السياسات الداخلية واللوائح الخارجية، فضلًا عن تطوير سياسات وإجراءات التقارير المالية، ومراقبة الامتثال لمعايير المحاسبة، وإجراء عمليات التدقيق.</li>
                <li aria-level="1"><strong>إدارة المخاطر:</strong> يُعدّ مسؤولًا عن تحديد وإدارة المخاطر المالية، بما في ذلك مخاطر السوق والائتمان والسيولة والتشغيل، وتنفيذ سياسات وإجراءات إدارة المخاطر، وتنويع الاستثمارات، والتحوط ضد المخاطر المالية.</li>
                <li aria-level="1"><strong>المتابعة مع أصحاب المصلحة:</strong> المدير المالي مسؤول أيضًا عن توصيل المعلومات المالية لأصحاب المصلحة، بما في ذلك المستثمرين والدائنين. وكذلك تطوير التقارير المالية والعروض التقديمية، والمشاركة في أنشطة علاقات المستثمرين وبناء العلاقات مع أصحاب المصلحة الرئيسيين.</li>
                <li aria-level="1"><strong>إدارة الفريق: </strong>من أهم مسؤوليات المدير المالي إدارة وتطوير فريق من المتخصصين الماليين، بما في ذلك المحاسبين والمحللين والمخططين الماليين، وتحديد توقعات الأداء، وتقديم التغذية الراجعة والتدريب، ووضع الخطط المهنية، واستقدام الكفاءات.</li>
                <li aria-level="1"><strong>إدارة الضرائب:</strong> يدير المدير المالي الالتزامات الضريبية للمؤسسة وضمان الامتثال للوائح الضريبية، وتطوير الاستراتيجيات الضريبية، وتحديد الإعفاءات الضريبية والخصومات، وإعداد الإقرارات الضريبية وتقديمها.</li>
                <li aria-level="1"><strong>إدارة عمليات الاندماج والاستحواذ:</strong> يشارك المدير المالي في أنشطة الاندماج والاستحواذ، ويقدم التقييم وفرص التمويل، فضلًا عن تحليل أهداف الاستحواذ المحتملة، والتفاوض على شروط الصفقة، وإدارة عملية التمويل.</li>
                <li aria-level="1"><strong>التخطيط الاستراتيجي:</strong> يشارك المدير المالي في تطوير الخطة الاستراتيجية للمنظمة، وتحديد الموارد المالية لدعم الخطة، وتحليل اتجاهات السوق، وتحديد فرص النمو، وتطوير الاستراتيجيات المالية لدعم أهداف المنظمة.</li>
                </ul>
                <p>ختامًا، تلعب الإدارة المالية دورًا جوهريًا في نجاح أي عمل تجاري، لذلك تتطلب فهمًا عميقًا لمبادئ المحاسبة والأسواق المالية، ومع بعض الجهد لفهم قواعدها ومبادئها يمكن للشركات تحقيق الاستقرار المالي، وزيادة الربحية وبناء أساس قوي للنجاح على المدى الطويل.</p>
                                                                                        <p class="article_first_publish">
                                                    تم النشر في:   <a class="meta_tag" href="https://blog.khamsat.com/tagged/%d9%85%d8%b4%d8%a7%d8%b1%d9%8a%d8%b9-%d9%86%d8%a7%d8%b4%d8%a6%d8%a9/">مشاريع ناشئة</a>									منذ 5 أيام									</p>
                                                </section>'
            ]);
        }
    }

    protected function createReviews()
    {
        for ($i = 1; $i < 200; $i++) {
            $gig_id = (Gig::inRandomOrder()->first())->id;
            $review = Review::create([
                'content' => fake()->realText(100),
                'reply' => fake()->randomElement([null, fake()->realText(50)]),
                'user_id' => (User::inRandomOrder()->first())->id,
                'gig_id' => $gig_id
            ]);

            foreach (getOption('reviews_types', []) as $slug => $type) {
                Rate::create([
                    'name' => $slug,
                    'count' => rand(1, 5),
                    "gig_id" => $gig_id,
                    "review_id" => $review->id
                ]);
            }
        }
    }

    protected function notifications()
    {
        for ($i = 1; $i < 100; $i++) {
            $user = User::find(4);

            $user->notify(new Test());
        }
    }

    protected function chats()
    {
        // for ($i = 1; $i < 100; $i++) {
        // $b = rand(1, 50);

        // Chat::firstOrCreate([
        //     'user_one' => user()->id,
        //     'user_two' => $b,
        //     'gig_id' => (Gig::inRandomOrder()->first())->id,
        // ]);

        // for ($j = 0; $j < 100; $j++) {
        //     ChatMessage::create([
        //         'content' => fake()->realText(40),
        //         'readed' => 'yes',
        //         'chat_id' => $chat->id,
        //         'user_id' => (User::inRandomOrder()->first())->id,
        //     ]);
        // }
        // }

        // for ($j = 0; $j < 200; $j++) {
        //     $chat = Chat::inRandomOrder()->first();

        //     ChatMessage::create([
        //         'content' => fake()->realText(40),
        //         'readed' => 'yes',
        //         'chat_id' => $chat->id,
        //         'user_id' => fake()->randomElement([$chat->user_one, $chat->user_two]),
        //     ]);
        // }
    }
}
